IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/C2000/f2838x_clk_cfg_regs.xml
<module id="CLK_CFG_REGS" HW_revision="" description="CLK CFG Registers">
	<register id="CLKSEM" width="32" page="1" offset="0x0" internal="0" description="Clock Control Semaphore Register">
		<bitfield id="SEM" description="Semaphore for CLKCFG Ownership by CPU1 or CPU2" begin="1" end="0" width="2" rwaccess="RW"/>
		<bitfield id="KEY" description="Key Qualifier for writes to this register" begin="31" end="16" width="16" rwaccess="RW"/>
	</register>
	<register id="CLKCFGLOCK1" width="32" page="1" offset="0x2" internal="0" description="Lock bit for CLKCFG registers">
		<bitfield id="CLKSRCCTL1" description="Lock bit for CLKSRCCTL1 register" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="CLKSRCCTL2" description="Lock bit for CLKSRCCTL2 register" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="CLKSRCCTL3" description="Lock bit for CLKSRCCTL3 register" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="SYSPLLCTL1" description="Lock bit for SYSPLLCTL1 register" begin="3" end="3" width="1" rwaccess="RW"/>
		<bitfield id="SYSPLLCTL2" description="Lock bit for SYSPLLCTL2 register" begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="SYSPLLCTL3" description="Lock bit for SYSPLLCTL3 register" begin="5" end="5" width="1" rwaccess="RW"/>
		<bitfield id="SYSPLLMULT" description="Lock bit for SYSPLLMULT register" begin="6" end="6" width="1" rwaccess="RW"/>
		<bitfield id="AUXPLLCTL1" description="Lock bit for AUXPLLCTL1 register" begin="7" end="7" width="1" rwaccess="RW"/>
		<bitfield id="AUXPLLMULT" description="Lock bit for AUXPLLMULT register" begin="10" end="10" width="1" rwaccess="RW"/>
		<bitfield id="SYSCLKDIVSEL" description="Lock bit for SYSCLKDIVSEL register" begin="11" end="11" width="1" rwaccess="RW"/>
		<bitfield id="AUXCLKDIVSEL" description="Lock bit for AUXCLKDIVSEL register" begin="12" end="12" width="1" rwaccess="RW"/>
		<bitfield id="PERCLKDIVSEL" description="Lock bit for PERCLKDIVSEL register" begin="13" end="13" width="1" rwaccess="RW"/>
		<bitfield id="CLBCLKCTL" description="Lock bit for CLBCLKCTL register" begin="14" end="14" width="1" rwaccess="RW"/>
		<bitfield id="LOSPCP" description="Lock bit for LOSPCP register" begin="15" end="15" width="1" rwaccess="RW"/>
		<bitfield id="XTALCR" description="Lock bit for XTALCR register" begin="16" end="16" width="1" rwaccess="RW"/>
		<bitfield id="ETHERCATCLKCTL" description="Lock bit for ETHERCATCLKCTL register" begin="17" end="17" width="1" rwaccess="RW"/>
		<bitfield id="CMCLKCTL" description="Lock bit for CMCLKCTL register" begin="18" end="18" width="1" rwaccess="RW"/>
	</register>
	<register id="CLKSRCCTL1" width="32" page="1" offset="0x8" internal="0" description="Clock Source Control register-1">
		<bitfield id="OSCCLKSRCSEL" description="OSCCLK Source Select Bit" begin="1" end="0" width="2" rwaccess="RW"/>
		<bitfield id="INTOSC2OFF" description="Internal Oscillator 2 Off Bit" begin="3" end="3" width="1" rwaccess="RW"/>
		<bitfield id="XTALOFF" description="Crystal (External) Oscillator Off Bit" begin="4" end="4" width="1" rwaccess="RW"/>
	</register>
	<register id="CLKSRCCTL2" width="32" page="1" offset="0xa" internal="0" description="Clock Source Control register-2">
		<bitfield id="AUXOSCCLKSRCSEL" description="AUXOSCCLK Source Select Bit" begin="1" end="0" width="2" rwaccess="RW"/>
		<bitfield id="CANABCLKSEL" description="CANA Clock Source Select Bit" begin="3" end="2" width="2" rwaccess="RW"/>
		<bitfield id="CANBBCLKSEL" description="CANB Clock Source Select Bit" begin="5" end="4" width="2" rwaccess="RW"/>
		<bitfield id="MCANABITCLKSEL" description="MCAN (global) Bit-Clock Source Select Bit" begin="11" end="10" width="2" rwaccess="RW"/>
	</register>
	<register id="CLKSRCCTL3" width="32" page="1" offset="0xc" internal="0" description="Clock Source Control register-3">
		<bitfield id="XCLKOUTSEL" description="XCLKOUT Source Select Bit" begin="3" end="0" width="4" rwaccess="RW"/>
	</register>
	<register id="SYSPLLCTL1" width="32" page="1" offset="0xe" internal="0" description="SYSPLL Control register-1">
		<bitfield id="PLLEN" description="SYSPLL enable/disable bit" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="PLLCLKEN" description="SYSPLL bypassed or included in the PLLSYSCLK path" begin="1" end="1" width="1" rwaccess="RW"/>
	</register>
	<register id="SYSPLLMULT" width="32" page="1" offset="0x14" internal="0" description="SYSPLL Multiplier register">
		<bitfield id="IMULT" description="SYSPLL Integer Multiplier" begin="7" end="0" width="8" rwaccess="RW"/>
		<bitfield id="ODIV" description="Output Clock Divider" begin="20" end="16" width="5" rwaccess="RW"/>
		<bitfield id="REFDIV" description="Reference Clock Divider" begin="28" end="24" width="5" rwaccess="RW"/>
	</register>
	<register id="SYSPLLSTS" width="32" page="1" offset="0x16" internal="0" description="SYSPLL Status register">
		<bitfield id="LOCKS" description="SYSPLL Lock Status Bit" begin="0" end="0" width="1" rwaccess="R"/>
		<bitfield id="SLIPS" description="SYSPLL Slip Status Bit" begin="1" end="1" width="1" rwaccess="R"/>
	</register>
	<register id="AUXPLLCTL1" width="32" page="1" offset="0x18" internal="0" description="AUXPLL Control register-1">
		<bitfield id="PLLEN" description="AUXPLL enable/disable bit" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="PLLCLKEN" description="AUXPLL bypassed or included in the AUXPLLCLK path" begin="1" end="1" width="1" rwaccess="RW"/>
	</register>
	<register id="AUXPLLMULT" width="32" page="1" offset="0x1e" internal="0" description="AUXPLL Multiplier register">
		<bitfield id="IMULT" description="AUXPLL Integer Multiplier" begin="7" end="0" width="8" rwaccess="RW"/>
		<bitfield id="ODIV" description="Output Clock Divider" begin="20" end="16" width="5" rwaccess="RW"/>
		<bitfield id="REFDIV" description="Reference Clock Divider" begin="28" end="24" width="5" rwaccess="RW"/>
	</register>
	<register id="AUXPLLSTS" width="32" page="1" offset="0x20" internal="0" description="AUXPLL Status register">
		<bitfield id="LOCKS" description="AUXPLL Lock Status Bit" begin="0" end="0" width="1" rwaccess="R"/>
		<bitfield id="SLIPS" description="AUXPLL Slip Status Bit" begin="1" end="1" width="1" rwaccess="R"/>
	</register>
	<register id="SYSCLKDIVSEL" width="32" page="1" offset="0x22" internal="0" description="System Clock Divider Select register">
		<bitfield id="PLLSYSCLKDIV" description="PLLSYSCLK Divide Select" begin="5" end="0" width="6" rwaccess="RW"/>
	</register>
	<register id="AUXCLKDIVSEL" width="32" page="1" offset="0x24" internal="0" description="Auxillary Clock Divider Select register">
		<bitfield id="AUXPLLDIV" description="AUXPLLCLK Divide Select" begin="2" end="0" width="3" rwaccess="RW"/>
		<bitfield id="MCANCLKDIV" description="Divider between CANFD Source Clock and CANFD Bit CLK" begin="12" end="8" width="5" rwaccess="RW"/>
	</register>
	<register id="PERCLKDIVSEL" width="32" page="1" offset="0x26" internal="0" description="Peripheral Clock Divider Selet register">
		<bitfield id="EPWMCLKDIV" description="EPWM Clock Divide Select" begin="1" end="0" width="2" rwaccess="RW"/>
		<bitfield id="EMIF1CLKDIV" description="EMIF1  Clock Divide Select" begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="EMIF2CLKDIV" description="EMIF2 Clock Divide Select" begin="6" end="6" width="1" rwaccess="RW"/>
	</register>
	<register id="XCLKOUTDIVSEL" width="32" page="1" offset="0x28" internal="0" description="XCLKOUT Divider Select register">
		<bitfield id="XCLKOUTDIV" description="XCLKOUT Divide Select" begin="1" end="0" width="2" rwaccess="RW"/>
	</register>
	<register id="CLBCLKCTL" width="32" page="1" offset="0x2a" internal="0" description="CLB Clocking Control Register">
		<bitfield id="CLBCLKDIV" description="CLB clock divider configuration." begin="2" end="0" width="3" rwaccess="RW"/>
		<bitfield id="TILECLKDIV" description="CLB Tile clock divider configuration." begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="CLKMODECLB1" description="Clock mode of CLB1" begin="16" end="16" width="1" rwaccess="RW"/>
		<bitfield id="CLKMODECLB2" description="Clock mode of CLB2" begin="17" end="17" width="1" rwaccess="RW"/>
		<bitfield id="CLKMODECLB3" description="Clock mode of CLB3" begin="18" end="18" width="1" rwaccess="RW"/>
		<bitfield id="CLKMODECLB4" description="Clock mode of CLB4" begin="19" end="19" width="1" rwaccess="RW"/>
		<bitfield id="CLKMODECLB5" description="Clock mode of CLB5" begin="20" end="20" width="1" rwaccess="RW"/>
		<bitfield id="CLKMODECLB6" description="Clock mode of CLB6" begin="21" end="21" width="1" rwaccess="RW"/>
		<bitfield id="CLKMODECLB7" description="Clock mode of CLB7" begin="22" end="22" width="1" rwaccess="RW"/>
		<bitfield id="CLKMODECLB8" description="Clock mode of CLB8" begin="23" end="23" width="1" rwaccess="RW"/>
	</register>
	<register id="LOSPCP" width="32" page="1" offset="0x2c" internal="0" description="Low Speed Clock Source Prescalar">
		<bitfield id="LSPCLKDIV" description="LSPCLK Divide Select" begin="2" end="0" width="3" rwaccess="RW"/>
	</register>
	<register id="MCDCR" width="32" page="1" offset="0x2e" internal="0" description="Missing Clock Detect Control Register">
		<bitfield id="MCLKSTS" description="Missing Clock Status Bit" begin="0" end="0" width="1" rwaccess="R"/>
		<bitfield id="MCLKCLR" description="Missing Clock Clear Bit" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="MCLKOFF" description="Missing Clock Detect Off Bit" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="OSCOFF" description="Oscillator Clock Off Bit" begin="3" end="3" width="1" rwaccess="RW"/>
	</register>
	<register id="X1CNT" width="32" page="1" offset="0x30" internal="0" description="10-bit Counter on X1 Clock">
		<bitfield id="X1CNT" description="X1 Counter" begin="9" end="0" width="10" rwaccess="R"/>
		<bitfield id="CLR" description="X1 Counter Clear" begin="16" end="16" width="1" rwaccess="RW"/>
	</register>
	<register id="XTALCR" width="32" page="1" offset="0x32" internal="0" description="XTAL Control Register">
		<bitfield id="OSCOFF" description="XTAL Oscillator powered-down" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="SE" description="XTAL Oscilator in Single-Ended mode" begin="1" end="1" width="1" rwaccess="RW"/>
	</register>
	<register id="ETHERCATCLKCTL" width="32" page="1" offset="0x36" internal="0" description="ETHERCATCLKCTL">
		<bitfield id="DIVSRCSEL" description="Clock source select for the etherCAT clock divider." begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="ECATDIV" description="etherCAT clock divider configuration." begin="3" end="1" width="3" rwaccess="RW"/>
		<bitfield id="PHYCLKEN" description="etherCAT PHY clock enable" begin="8" end="8" width="1" rwaccess="RW"/>
	</register>
	<register id="CMCLKCTL" width="32" page="1" offset="0x38" internal="0" description="CMCLKCTL">
		<bitfield id="CMDIVSRCSEL" description="Clock source select for the CM clock divider." begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="CMCLKDIV" description="CM clock divider configuration." begin="3" end="1" width="3" rwaccess="RW"/>
		<bitfield id="ETHDIVSRCSEL" description="Clock source select for the etherNET clock divider." begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="ETHDIV" description="Ethernet clock divider configuration" begin="7" end="5" width="3" rwaccess="RW"/>
	</register>
</module>
